STMicroelectronics/STM32PRGFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_bsec.c
    if((stickyLockStatus & BSEC_OTP_STICKY_LOCK_PROG_FUSE) != 0)
    {
      /* Update Error description : sticky programming lock of that otp word */
      hBsec->Error |= BSEC_ERROR_STICKY_LOCK_PROG;

      return(HAL_ERROR); /* Early exit */
    }

    /* If we arrive here : OTP word 'otpWordIdx' is */
    /* Not permanently programming locked NOR sticky programming locked */

    /* From there two possibilities */
    /* 1- If the OTP Word 'otpWordIdx' is NOT Sticky Read Locked and we can verify if the value  */
    /* we aim to program is possible to program, before actually programming it                  */
    /* 2- If the OTP Word 'otpWordIdx' is Sticky Read Locked we cannot verify the value aimed to */
    /* be programmed is possible we will simply attempt the programming of the target value      */

    /* Is OTP Word 'otpWordIdx' Sticky Read Locked ? */
    status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_SRLOCK, otpWordIdx, &stickyReadLockBitValue);
    if(status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_SOFT_DRIVER;

      return(HAL_ERROR); /* Early exit */
    }

    /* if OTP word 'otpWordIdx' is NOT Sticky Read Locked then we can handle the verification of */
    /* possibility to program 'otpWordValReq' in OTP word 'otpWordIdx' ...             */
    if(stickyReadLockBitValue == 0)
    {
      /* Case 1- OTP Word 'otpWordIdx' is NOT Sticky Read Locked */

      /* Step 2a/2b- Continue by attempting to read OTP word from SAFMEM to */
      /* know if targeted programming value is possible           */
      status = HAL_BSEC_OtpRead(hBsec, otpWordIdx, (uint32_t *)&otpShadowValBeforeProg);
      if(status != HAL_OK)
      {
        /* Update Error description */
        hBsec->Error |= BSEC_ERROR_SOFT_DRIVER;

        return(HAL_ERROR); /* Early exit */
      }

      /* Step 3a- Value 'otpWordValReq' possible to write in SAFMEM ? */
      /* otpDiffWord = otpShadowValBeforeProg XOR otpWordValReq */
      /* all bits set to 1b1' in 'otpDiffWord' are the bits that are requested to be changed */
      /* check for number of transitions 1->0 : if any, the value 'otpWordValReq' have no chance */
      /* to be programmed in SAFMEM */
      otpDiffWord = (otpShadowValBeforeProg ^ otpWordValReq);

      for(bit = 0; ((bit < 32) && (impossibleValDetected == 0)); bit++)
      {
        /* Look for bits different in 'otpShadowValBeforeProg' and 'otpWordValReq' */
        if((otpDiffWord & (1 << bit)) != 0)
        {
          /* bit is different */
          if(((otpShadowValBeforeProg & (1 << bit)) != 0)  &&
            ((otpWordValReq & (1 << bit)) == 0))
          {
            /* This is a 1 -> 0 transition : impossible with SAFMEM technology ! */
            impossibleValDetected = 1;
          }

        } /* of if((otpDiffWord & (1 << bit) != 0)) */

      } /* of for(bit = 0; ((bit < 32) && (impossibleValDetected == 0)); bit++) */

      if(impossibleValDetected == 1)
      {
        /* Value is not possible to program in SAFMEM : return error */
        /* Update Error description : not possible to write wanted value in SAFMEM */
        hBsec->Error |= BSEC_ERROR_PROG_VALUE_NOT_POSSIBLE;

        return(HAL_ERROR); /* Early exit */
      }

      /* If we are still here, the value is possible to be programmed */

    } /* of if(stickyReadLockBitValue == 0) */

    /* In Case 2- OTP Word 'otpWordIdx' is Sticky Read Locked        */
    /* we have not handled the step above and will program in "blind mode" */


    /* Step 3b- Proceed with programming of 'otpWordValReq' */

    /* Polling until all previous ongoing BSEC operations are finished */
    timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
    if(timeoutDetected != 0)
    {
      hBsec->Error |= BSEC_ERROR_TIMEOUT;

      return(HAL_ERROR); /* Early exit */
    }

    if(stickyReadLockBitValue == 0)
    {
      /* No timeout detected and all bit transitions are then 0->1 in the differing bits between old  */
      /* value and value requested to be programmed                           */
      /* >> CR#108580 - [bootROM / BSEC driver] : implement workaround to save polyfuse transistor life */

      /* Program register BSEC_OTP_WRDATA with value to program 'otpDiffWord'   */
      /* only modified bits representing a transition 0-> are programmed    */
      /* no reprogramming of a transition 1->1 to save polyfuse transistor life */
      hBsec->Instance->BSEC_OTP_WRDATA = otpDiffWord;

      /* CR#108580 - [bootROM / BSEC driver] : implement workaround to save polyfuse transistor life << */

    } /* of if(stickyReadLockBitValue == 0) */
    else
    {
      /* Due to Sticky Read Lock, We are in "blind mode" ... */
      hBsec->Instance->BSEC_OTP_WRDATA = otpWordValReq;
    }

    /* Prepare Program operation with bit lock reset on OTP bit address corresponding to 'otpWordIdx' */
    regVal = (BSEC_OTP_CONTROL_PROG_PROGRAM_VALUE << BSEC_OTP_CONTROL_PROG_Pos)   |
        (BSEC_OTP_CONTROL_LOCK_NOTLOCKED_VALUE << BSEC_OTP_CONTROL_LOCK_Pos) |
        ((otpWordIdx & BSEC_OTP_CONTROL_ADDR) << BSEC_OTP_CONTROL_ADDR_Pos);

    /* Atomic write of OTP_CONTROL is required */
    hBsec->Instance->BSEC_OTP_CONTROL = regVal;

    /* Wait until end of BSEC programming operation */
    timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
    if(timeoutDetected != 0)
    {
      hBsec->Error |= BSEC_ERROR_TIMEOUT;

      return(HAL_ERROR); /* Early exit */
    }

    /* No timeout detected ... */
    /* Test programming fail indicator post programming operation */
    if((hBsec->Instance->BSEC_OTP_STATUS & BSEC_OTP_STATUS_PROGFAIL) != 0)
    {
      /* PROGFAIL indication : programming was not successful */
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_PROG_FAIL;

      return(HAL_ERROR); /* Early exit */
    }

    /* No PROGFAIL indication : programming was successful                    */
    /* Step 4- Reload shadow register : handle it only if the OTP Word is not */
    /* Sticky Lock Read, because otherwise it has no effect at all ...        */
    if(stickyReadLockBitValue == 0)
    {
      /* Reload newly programmed OTP value in OTP shadow register request */
      status = HAL_BSEC_OtpRead(hBsec, otpWordIdx, (uint32_t *)&otpShadowValAfterProg);

      return(status);

    } /* of if(stickyReadLockBitValue == 0) */

