STMicroelectronics/STM32PRGFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_bsec.c
  } /* of if(hBsec->State == BSEC_STATE_SAFMEM_PWRUP) */

  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= BSEC_ERROR_SAFMEM_PWRDOWN;

    return(HAL_ERROR); /* Early exit */
  }

  return(HAL_OK);
}


/**
* @brief   This function reads the BSEC scratch register word (32 bits).
* @param   [in] hBsec         : BSEC handle
* @param   [in/out] pScratchReadVal : pointer to read the scratch word.
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_ReadScratch(BSEC_HandleTypeDef * hBsec, uint32_t * pScratchReadVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pScratchReadVal != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if(hBsec->State >= BSEC_STATE_READY)
  {
    /* Read BSEC_SCRATCH */
    * pScratchReadVal = hBsec->Instance->BSEC_SCRATCH;

    retVal = HAL_OK;

  } /* if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
* @brief   This function writes the BSEC scratch register with word (32 bits) given in
*      parameter. Using register BSEC_SCRATCH register, always accessible (always On power domain),
*      but reset to its reset value (0x0) by a Power Up Reset.
* @param   [in] hBsec       : BSEC handle
* @param   [in] scratchWriteVal : word value to write in BSEC_SCRATCH register.
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_WriteScratch(BSEC_HandleTypeDef * hBsec, uint32_t scratchWriteVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if(hBsec->State >= BSEC_STATE_READY)
  {
    /* Write BSEC_SCRATCH */
    hBsec->Instance->BSEC_SCRATCH = scratchWriteVal;

    retVal = HAL_OK;

  } /* if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
* @brief   This function reads a CLTAP word (32 bits) written by JTAG/PC or tester side
*      MPU-AP SoC Receive direction, using BSEC_JTAGIN register.
* @param   [in] hBsec      : BSEC handle
* @param   [in/out] pJtagReadVal : pointer to half word (16 bits) read from Jtag.
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_JtagInRead(BSEC_HandleTypeDef * hBsec, uint16_t * pJtagReadVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pJtagReadVal != (uint16_t *)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if(hBsec->State >= BSEC_STATE_READY)
  {
    /* Read BSEC_JTAGIN */
    * pJtagReadVal = (uint16_t)(hBsec->Instance->BSEC_JTAGIN & BSEC_JTAGIN_DATA);

    retVal = HAL_OK;

  } /* if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
* @brief   This function writes a JTAG word (32 bits) toward PC/JTAG :
*      MPU-AP SoC Transmit direction, using BSEC_JTAGOUT register.
* @param   [in] hBsec     : BSEC handle
* @param   [in] jtagWriteVal  : half word value (16 bits) to write to BSEC_JTAGOUT.
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_JtagOutWrite(BSEC_HandleTypeDef * hBsec, uint16_t jtagWriteVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if(hBsec->State >= BSEC_STATE_READY)
  {
    /* write BSEC_JTAGOUT */
    hBsec->Instance->BSEC_JTAGOUT = (jtagWriteVal & BSEC_JTAGOUT_DATA);

    retVal = HAL_OK;

  } /* if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
* @brief   This function sets sticky locks (ie until next Power On Reset) read or write
*      depending on function and per functions in the following list :
*      - OTP Upper OTP Read : shadow sticky load read for upper part OTP words : OTP[32..95] : those
*      containing ST or OEM secrets.
*      - Debug Enable Write : for debug (CoreSight) access control (global, for non invasive or invasive acces in
*      either non secure or secure privileged modes) : allows to disable or re-enable a debug access.
*      - ROMLOCK : allows to unmap the upper 8 kBytes of ROM and sticky lock this unmap : this can be done
*      by Sw only when the sample is SEC_OPEN. In all others states of the life cycle (OPEN1/OPEN2/SEC_FINAL/OTP_INVALID),
*      the unmap of upper 8 kBytes of ROM is handled by Hw and cannot be overriden by Sw.
*      - PROG_GLOBAL_OTP : Sticky lock programming of all OTPs until next system reset
* @param   [in] hBsec      : BSEC handle
* @param   [in] setFunctionLockMask : Mask set of functions to lock should be a value
*         created by ORring one or more of values from @ref BSEC_FuncStickyLockTypeDef.
*         The @ref BSEC_FuncStickyLockTypeDef are directly mapping the Hw register BSEC_OTP_LOCK.
*         Note : each bit for which the feature should be locked should have value 1b1', values to 1b0'
*         have no locking effect (and no clearing of a previous lock also !!).
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_FunctionSetLock(BSEC_HandleTypeDef * hBsec, uint32_t setFunctionLockMask)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t maxFuncLockFieldVal = (BSEC_FUNC_STICKY_LOCK_PROG_GLOBAL_OTP |
                  BSEC_FUNC_STICKY_LOCK_ROMLOCK     |
                  BSEC_FUNC_STICKY_LOCK_DENABLE_WRITE   |
                  BSEC_FUNC_STICKY_LOCK_OTP_UPPER_READ);
  uint32_t setFunctionMaskEffective = 0;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

