STMicroelectronics/STM32PRGFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_bsec.c
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
* @brief   This function gets OTP sticky lock status for the OTP word of index
*      'otpWordIdx'.
*      Each kind of sticky locking is checked for 'otpWordIdx' it can be a combination of items in the list :
*      - OTP programming lock command
*      - OTP shadow register write lock command
*      - OTP shadow register read lock command
*      Note : this parameter should take values from @ref BSEC_OtpStickyLockTypeDef.
* @param   [in] hBsec      : BSEC handle
* @param   [in] otpWordIdx   : OTP word index for which the sticky lock command is processed.
* @param   [in] pStickyLockStatus  : Composite Sticky lock status : a combination of values from
*         type @ref BSEC_OtpStickyLockTypeDef
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetOtpStickyLockStatus(BSEC_HandleTypeDef * hBsec,
                       uint32_t       otpWordIdx,
                       uint32_t       * pStickyLockStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t regIdx = 0;
  uint32_t regBit = 0;
  __IO uint32_t stickyLockStatus = 0;
  __IO uint32_t splock_flag = 0;
  __IO uint32_t swlock_flag = 0;
  __IO uint32_t srlock_flag = 0;
  __IO uint32_t * ptrReg1 = (uint32_t *)NULL;
  __IO uint32_t * ptrReg2 = (uint32_t *)NULL;
  __IO uint32_t * ptrReg3 = (uint32_t *)NULL;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  if(otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if(hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      HAL_BSEC_Div(otpWordIdx, 32, &regIdx, &regBit);

      /* Be careful : the lines below works because we add pointers uint32_t*    */
      /* So base address of the lock register (P,W,R) is incremented by (regIdx * 4) */
      ptrReg1 = &(hBsec->Instance->BSEC_OTP_SPLOCK0)  + regIdx;
      ptrReg2 = &(hBsec->Instance->BSEC_OTP_SWLOCK0)  + regIdx;
      ptrReg3 = &(hBsec->Instance->BSEC_OTP_SRLOCK0)  + regIdx;

      splock_flag = (* ptrReg1 & (1 << regBit));
      swlock_flag = (* ptrReg2 & (1 << regBit));
      srlock_flag = (* ptrReg3 & (1 << regBit));

      /* Check sticky lock programming status */
      if(splock_flag != 0)
      {
        stickyLockStatus |= BSEC_OTP_STICKY_LOCK_PROG_FUSE;
      }

      /* Check sticky lock write shadow status */
      if(swlock_flag != 0)
      {
        stickyLockStatus |= BSEC_OTP_STICKY_LOCK_WRITE_SHADOW;
      }

      /* Check sticky lock read shadow status */
      if(srlock_flag != 0)
      {
        stickyLockStatus |= BSEC_OTP_STICKY_LOCK_UPDATE_SHADOW;
      }

      * pStickyLockStatus = (uint32_t)stickyLockStatus;

      retVal = HAL_OK;

    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
* @brief   This function gets OTP error status for the OTP word of index 'otpWordIdx'.
* @param   [in] hBsec      : BSEC handle
* @param   [in] otpWordIdx  : OTP word index
* @param   [in] pErrorStatus : error status. 0 means no error, 1 means error
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetOtpErrorStatus(BSEC_HandleTypeDef * hBsec,
                       uint32_t       otpWordIdx,
                       uint32_t       * pErrorStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  if(otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if(hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      retVal = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_ERROR, otpWordIdx, pErrorStatus);
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
* @brief   This function gets OTP disturb status for the OTP word of index 'otpWordIdx'.
* @param   [in] hBsec      : BSEC handle
* @param   [in] otpWordIdx  : OTP word index
* @param   [in] pDisturbStatus : disturb status
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetOtpDisturbStatus(BSEC_HandleTypeDef * hBsec,
                       uint32_t       otpWordIdx,
                       uint32_t       * pDisturbStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  if(otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if(hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      retVal = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_DISTURBED, otpWordIdx, pDisturbStatus);
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
* @brief   This function returns a mask of feature currently disabled in EWS stage by SAFMEM OTP_DATA1 word programming.
* @param   [in] hBsec          : BSEC handle
* @param   [in/out] pMaskFeatDisabled  : pointer to get the mask of feature currently disabled by OTP_DATA1.
*
*      Careful here a value 1b1' in the bitmask[i] means that the corresponding feature :
*      (1 << BSEC_OtpFeatureStickyLockTypeDef[i]) is disabled by OTP programming and not accessible to hardware.
*      But can be potentially re-enabled by programming BSEC_FENABLE[i] = 1b1' on a secure sample
*      (ie BSEC_OTP_STATUS.OTP_SECURED=1b1').
*      bitmask[i] = 1b0' means that the feature is not disabled by OTP, hence Hw accessible.
*
*      Note : The check of SAFMEM readiness is done by second level function.
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetFeatureDisabled(BSEC_HandleTypeDef * hBsec, uint32_t * pMaskFeatDisabled)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  uint32_t featureDisabledValidMask = ((1 << (BSEC_FEAT_MAX + 1)) - 1);
  __IO uint32_t otpShadowReadVal = 0;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pMaskFeatDisabled != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  /* Read feature disabled from BSEC_OTP_DATA1 as always copied from SAFMEM for that word */
  /* BSEC Ready state is checked by second level function BSEC_OtpShadowRead() here     */
  status = HAL_BSEC_OtpShadowRead(hBsec, 1, (uint32_t*)&otpShadowReadVal);
  if(status == HAL_OK)
  {
    /* Mask OTP word read value with only feature disabled mask */
    otpShadowReadVal = (otpShadowReadVal & featureDisabledValidMask);

