STMicroelectronics/STM32PRGFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_bsec.c
    * pMaskFeatDisabled = otpShadowReadVal;
  }

  return (status);
}

/**
* @brief   This function returns the value of bit OTP_DATA1.fdis_tk that gives information of ST Key Provisioning
*      have already been handled (when value 1b1') or not yet handled (when value is 1b0').
* @param   [in] hBsec       : BSEC handle
* @param   [in/out] pFdisTkValue  : pointer to get value of bit OTP_DATA1.fdis_tk
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetFdisTkValue(BSEC_HandleTypeDef * hBsec, uint32_t * pFdisTkValue)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  __IO uint32_t otpShadowReadVal = 0;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pFdisTkValue != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  /* Read feature disabled from BSEC_OTP_DATA1 as always copied from SAFMEM for that word */
  /* BSEC Ready state is checked by second level function BSEC_OtpShadowRead() here     */
  status = HAL_BSEC_OtpShadowRead(hBsec, 1, (uint32_t*)&otpShadowReadVal);
  if(status == HAL_OK)
  {
    * pFdisTkValue = ((otpShadowReadVal & (1 << BSEC_OTP_CFG1_FDIS_TK_BIT_POS)) >> BSEC_OTP_CFG1_FDIS_TK_BIT_POS);
  }

  return (status);
}

/**
* @brief   This function is used during ST Key Provisioning to read TK from 4 read
*      in BSEC_SCRATCH register. This is only possible if OTP Mode = OTP_SECURE and
*      fdis_tk = 0.
*      The table to get the TK should be allocated externally to a size of 4 uint32_t
* @param   [in] hBsec    : BSEC handle
* @param   [in/out] tkValue  : pointer to get value TK
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetTk(BSEC_HandleTypeDef * hBsec, uint32_t * tkValue)
{
  uint32_t idx = 0;
  HAL_StatusTypeDef status;
  uint32_t * pReadPointer = &(tkValue[3]); /* Initialize read pointer to key LSWord start position for the key retrieve */

  /*
   * Important Note :
   * If TK = AES 128 Key is 0x00112233445566778899AABBCCDDEEFF => will be used externally as uint8_t aes_key[16]
   * and called as BSEC_GetTk(hBsec, (uint32_t *) aes_key) : we expect to read :
   * aes_key[16] = { 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF }
   * First read BSEC_SCRATCH will retrieve LSWord of Key -> 0xCCDDEEFF
   * Second read BSEC_SCRATCH will retrieve        -> 0x8899AABB
   * Third  read BSEC_SCRATCH will retrieve        -> 0x44556677
   * Fourth read BSEC_SCRATCH will retrieve        -> 0x00112233
   * Hence the implementation below :
   */

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (tkValue != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  for(idx = 0; idx < 4; idx++)
  {
    /* Read BSEC_SCRATCH but do not care about eventual errors */
    status = HAL_BSEC_ReadScratch(hBsec, pReadPointer);

    pReadPointer--; /* decrement pReadPointer */
  }

  return (status);
}

/**
* @brief   This function gets debug signals enabled/disabled status by reading BSEC register 'BSEC_DENABLE'.
* @param   [in] hBsec          : BSEC handle
* @param   [in/out] pDebugMaskEnabled  : pointer to get the mask of debug signals enabled/disabled.
*                    Any bit value in mask set to 1b1' means a debug signal that is enabled,
*                    while 1b0' bit in mask means a debug signal disabled
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetDebugEnabled(BSEC_HandleTypeDef * hBsec, uint32_t * pDebugMaskEnabled)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t validMask = ((1 << (BSEC_DEBUG_ENABLE_MAX + 1)) - 1);

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pDebugMaskEnabled != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  /* The BSEC driver should be at least in ready state */
  if(hBsec->State >= BSEC_STATE_READY)
  {
    * pDebugMaskEnabled = ((hBsec->Instance->BSEC_DENABLE) & validMask);

    retVal = HAL_OK;
  }
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Detail error */
    hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
* @brief   This function set debug signals enabled/disabled mask by writing to write register 'BSEC_DENABLE'
*      to an enable/disable mask value in second parameter.
*      This is possible if the BSEC_DENABLE register is not currently sticky write locked.
* @param   [in] hBsec         : BSEC handle
* @param   [in/out] debugMaskEnabled  : Mask of disable/enable of debug signals.
*                     Any value set to 1b1' means debug signal is enabled,
*                     1b0' is a debug signal disabled
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_SetDebugEnabled(BSEC_HandleTypeDef * hBsec, uint32_t debugMaskEnabled)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t validMask = ((1 << (BSEC_DEBUG_ENABLE_MAX + 1)) - 1);

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking);

  if(debugMaskEnabled <= validMask)
  {
    /* The BSEC driver should be at least in ready state */
    if(hBsec->State >= BSEC_STATE_READY)
    {
      /* Is debug enable function locked sticky ?               */
      /* Decision here to use direct register access instead of function call */
      /* BSEC_FunctionGetLock() which would take longer processing time     */
      if((hBsec->Instance->BSEC_OTP_LOCK & BSEC_OTP_LOCK_DENREG) != 0)
      {
        /* Yes the debug enable is sticky locked (write)       */
        /* Not possible to write currently the register BSEC_DENABLE */
        /* Update Error description */
        hBsec->Error |= BSEC_ERROR_LOCK_WRITE;
      }
      else
      {
        /* BSEC_DENABLE is not sticky write locked : proceed to write BSEC_DENABLE */
        hBsec->Instance->BSEC_DENABLE = (debugMaskEnabled & validMask);
        retVal = HAL_OK;
      }
    }
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Detail error */
      hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
* @brief   This function reads in *pPKH the public key HASH (SHA-256) from OTP_DATA[31:24]
*      This is the hash by SHA-256 of the public key used for authentication of the First Stage Boot Loader (FSBL).
* @param   [in] hBsec         : BSEC handle
* @param   [in] readMode      : read mode should take value from @ref BSEC_ReadModeTypeDef.
* @param   [in] pkhOtpFirstWordIdx  : first OTP word index of PKH
* @param   [in/out] pPKH      : Pointer to read the public key (the memory should have been allocated externally).
*
* Note : prior the get an array of 32 bytes should have been allocated externally from this BSEC function, there
*    is no static or dynamic memory allocation in the current function.
*
* @retval  HAL_StatusTypeDef : Returned value.
******************************************************************************
*/
HAL_StatusTypeDef HAL_BSEC_GetPKH(BSEC_HandleTypeDef * hBsec,
               BSEC_ReadModeTypeDef readMode,
               uint32_t       pkhOtpFirstWordIdx,
               const uint8_t    * pPKH)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  HAL_StatusTypeDef status = HAL_OK;
  __IO uint32_t * pPubKeyHashWord = (__IO uint32_t *)NULL;
  uint32_t otpWordIdx = 0;

  /* Verify input parameters validity */
  //INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pPKH != (uint8_t *)NULL)),BSECDRV,AssertBlocking);

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = BSEC_ERROR_NONE;

  if(pkhOtpFirstWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* Initialize 'pPubKeyHashWord' */
    pPubKeyHashWord = (uint32_t *)pPKH;

