STMicroelectronics/STM32PRGFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_bsec.c
    if(readMode == BSEC_READ_FROM_SHADOW)
    {
      /* The BSEC driver should be at least in ready state */
      if(hBsec->State >= BSEC_STATE_READY)
      {
        for(otpWordIdx = pkhOtpFirstWordIdx; ((otpWordIdx < (pkhOtpFirstWordIdx + 8)) && (status == HAL_OK)); otpWordIdx++)
        {
          status = HAL_BSEC_OtpShadowRead(hBsec, otpWordIdx, (uint32_t *)pPubKeyHashWord);
          pPubKeyHashWord++;
        }

        /* Return the status : which can be early exit case if issue occurred, in that case the contents */
        /* of *pPKH should not be trusted and used : hBsec->Error will have been updated by HAL_BSEC_OtpRead() or */
        /* BSEC_OtpShadowRead() function */
        retVal = status;
      }
      else
      {
        /* Error BSEC driver and hardware is not in ready state */
        /* Update Error description */
        hBsec->Error |= BSEC_ERROR_DRIVER_NOT_READY;
      }

    } /* of if(readMode == BSEC_READ_FROM_SHADOW) */
    else
    {
      /* Read from SAFMEM ... */
      /* The BSEC driver should be at least in state SAFMEM Pwr Up */
      if(hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
      {
        /* Force update of shadows from SAFMEM before reading from shadows                    */
        /* This takes longer time and assumes we do not trust at the point we read the OTP shadow registers values */
        for(otpWordIdx = pkhOtpFirstWordIdx; ((otpWordIdx < (pkhOtpFirstWordIdx + 8)) && (status == HAL_OK)); otpWordIdx++)
        {
          status = HAL_BSEC_OtpRead(hBsec, otpWordIdx, (uint32_t *)pPubKeyHashWord);
          pPubKeyHashWord++;
        }

        /* Return the status : which can be early exit case if issue occurred, in that case the contents */
        /* of *pPKH should not be trusted and used : hBsec->Error will have been updated by HAL_BSEC_OtpRead() or */
        /* BSEC_OtpShadowRead() function */
        retVal = status;
      }
      else
      {
        /* Error BSEC driver and hardware is not in SAFMEM Pwr Up */
        /* Update Error description */
        hBsec->Error |= BSEC_ERROR_SAFMEM_PWRDOWN;
      }

    } /* of else Read from SAFMEM */

  } /* of if(pkhOtpFirstWordIdx <= BSEC_OTP_WORD_INDEX_MAX) */
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
* @brief   This static function implements simple integer division
*      (A div B) and (A mod B) to obtain quotient in *pQ and remainder (modulo) in *pR.
*
* @param   [in] A    : dividend
* @param   [in] B    : divider
* @param   [in/out] pQ : integer quotient
* @param   [in/out] pR : modulo
* @retval  Void.
******************************************************************************
*/
void HAL_BSEC_Div(uint32_t A, uint32_t B, uint32_t * pQ, uint32_t * pR)
{
  uint32_t a = A;
  uint32_t q = 0;

  //INFASSERTS_REQUIRE(((pQ != (uint32_t *)NULL) && (pR != (uint32_t *)NULL)),BSECDRV,AssertBlocking);

  while(a >= B)
  {
    a = (a - B);
    q++;
  }

  * pR = a;
  * pQ = q;
}

/**
* @brief   This function wait until bit BSEC_OTP_CONTROL.BUSY is 1b0'
*      before a timeout.
* @param   [in]   hBsec       : BSEC handle
*
* @retval  timeoutDetected : value 0x1 if timeout was detected while
*      waiting for bit BUSY to be cleared.
******************************************************************************
*/
uint32_t HAL_BSEC_WaitBusyClearWithTimeout(BSEC_HandleTypeDef * hBsec)
{
  uint32_t timerValInit = 0;
  uint32_t timeoutDetected = 0;

  //INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking);

  /* Get timer current value at start of loop */
  timerValInit = HAL_GetTick();

  while(((hBsec->Instance->BSEC_OTP_STATUS & BSEC_OTP_STATUS_BUSY) != 0) &&
       (timeoutDetected == 0))
  {
    /* Sense timeout occurrence */
    if((HAL_GetTick() - timerValInit) >= BSEC_TIMEOUT_VAL)
    {
      timeoutDetected = 1;
    }

  } /* of while loop */

  return(timeoutDetected);
}

#endif /* HAL_BSEC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

